#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff

terraform
google_storage_bucket.backend: Refreshing state... [id=chatbot-infra-terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_iam_policy.invoker will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "invoker"  {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # google_cloud_run_service.app will be created
  + resource "google_cloud_run_service" "app" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "api-checker"
      + project                    = "chatbot-infra"
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                }
              + generation       = (known after apply)
              + labels           = {
                  + "service" = "api-checker"
                }
              + name             = "api-checker-vv0-0-1"
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = 1
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 30

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/chatbot-infra/ww24/github.com/ww24/api-checker:v0.0.1"

                  + env {
                      + name  = "SLACK_CHANNEL"
                      + value = "C038GV0J8QY"
                    }
                  + env {
                      + name = "SLACK_TOKEN"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "projects/chatbot-infra/secrets/api-checker-slack-token"
                            }
                        }
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "500m"
                          + "memory" = "128Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # google_cloud_run_service_iam_policy.invoker will be created
  + resource "google_cloud_run_service_iam_policy" "invoker" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = (known after apply)
      + project     = "chatbot-infra"
      + service     = "api-checker"
    }

  # google_project_iam_member.cloudprofiler will be created
  + resource "google_project_iam_member" "cloudprofiler" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chatbot-infra"
      + role    = "roles/cloudprofiler.agent"
    }

  # google_project_iam_member.cloudtrace will be created
  + resource "google_project_iam_member" "cloudtrace" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chatbot-infra"
      + role    = "roles/cloudtrace.agent"
    }

  # google_secret_manager_secret_iam_member.secret-access will be created
  + resource "google_secret_manager_secret_iam_member" "secret-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "projects/chatbot-infra/secrets/api-checker-slack-token"
    }

  # google_service_account.app will be created
  + resource "google_service_account" "app" {
      + account_id   = "api-checker"
      + disabled     = false
      + display_name = "api-checker Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.invoker will be created
  + resource "google_service_account" "invoker" {
      + account_id   = "api-checker-invoker"
      + disabled     = false
      + display_name = "api-checker-invoker Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.backend will be updated in-place
  ~ resource "google_storage_bucket" "backend" {
        id                          = "chatbot-infra-terraform"
      ~ labels                      = {
          + "service" = "terraform"
        }
        name                        = "chatbot-infra-terraform"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @ww24, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*